app/controllers/books_controller.rb

    def index
        @books = Book.where(nil)
        @books = Book.filter(params[:filter]) if params[:filter].present?
---
SELECT "books".* FROM "books" WHERE (director like '%raja%')
SELECT "books".* FROM "books"

    def create
        if @current_user.admin?
            @book = Book.new(book_params)
            if @book.save
---
INSERT INTO "books" ("title", "author", "rating") VALUES (?, ?, ?)  [["title", "Test1"], ["author", "Test"], ["rating", 9.0]]

    def destroy
        if @current_user.admin?
            @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]