app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = @current_user.id
        @comment.post_id = params[:post_id]
        if @comment.save && @comment.post_id
---
INSERT INTO "comments" ("description", "post_id", "user_id") VALUES (?, ?, ?)  [["description", "Not at all interested :|"], ["post_id", 5], ["user_id", 2]]

    def show_by_posts
        @comments = Comment.where(post_id: params[:post_id])

        @post = Post.find(params[:post_id])

        if @comments && @post
            render json: {post: @post, comment: @comments, user: User.find(@post.user_id).as_json(only: [:username,:email])}
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def show_by_posts_users
        @comments = Comment.where(post_id: params[:post_id]).where(user_id: params[:user_id])

        @post = Post.find(params[:post_id])
        if @comments && @post
            render json: {post: @post, comment: @comments, user: User.find(@post.user_id).as_json(only: [:username,:email])}
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        if @current_user.admin? || @current_user == @Comment.user_id
            @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]