app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (director like '%raj%') AND (rating like '%6%')
SELECT "movies".* FROM "movies"
---
    def index
        @movies = Movie.where(nil)
        @movies = Movie.filter(params[:filter]) if params[:filter].present?

INSERT INTO "movies" ("title", "director", "rating") VALUES (?, ?, ?)  [["title", "Saaho"], ["director", "Thilak"], ["rating", 7.0]]
---
    def create
        if @current_user.admin?
            @movie = Movie.new(movie_params)

            if @movie.save

UPDATE "movies" SET "rating" = ? WHERE "movies"."id" = ?  [["rating", 9.0], ["id", 1]]
---
    def update
        if @movie.update(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
    def destroy
        if @current_user.admin?
            @movie.destroy