app/controllers/posts_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."category_name" = ? LIMIT ?  [["category_name", "songs"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("review", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["review", "Good movie"], ["commentable_type", "Movie"], ["commentable_id", 1], ["user_id", 2], ["created_at", "2021-07-12 09:15:54.326545"], ["updated_at", "2021-07-12 09:15:54.326545"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = @current_user.id
        if Category.find_by(category_name: params[:commentable_name]).isReviewable?
            if params[:commentable_name]=='movies'
                @post.commentable=Movie.find_by(id: params[:commentable_id])
            elsif params[:commentable_name]=='books'
                @post.commentable=Book.find_by(id: params[:commentable_id])
            end

            if @post.save  && @post.commentable_id

SELECT  "categories".* FROM "categories" WHERE "categories"."category_name" = ? LIMIT ?  [["category_name", "songs"], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def custom_show

        if Category.find_by(category_name: params[:commentable_name]).isReviewable?
            if params[:commentable_name]=="movies"
                @item=Movie.find_by(id: params[:commentable_id])
            elsif params[:commentable_name]=="books"
                @item=Book.find_by(id: params[:commentable_id])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
    def destroy
        if @current_user.id == @post.user_id
            @post.destroy