app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        @songs = Song.where(nil)
        @songs = Song.filter(params[:filter]) if params[:filter].present?