app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest") VALUES (?, ?, ?)  [["username", "Dhruv"], ["email", "dhruv.patwari@gmail.com"], ["password_digest", "$2a$12$202lETtvvx4PXEYTIgjZ/u41DPrFy8.YvTMA9VqLbuq/QKIaHc5MW"]]
---
    def create
        @user = User.new(user_params)
        #@user.user = current_user
        if @user.save

UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$FZgN525oSRuImGzOA394f.9C2ShI2qOoKjqQ7cxEWic/S1FTX0Y6m"], ["id", 1]]
---
    def update
        if @user.update(user_params)